In [1]:
import numpy as n

In [2]:
import pandas as p

In [3]:
n.random.seed(101)
mydata = n.random.randint(0,101,(4,3)) # creating 2 arrays
mydata

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]])

In [4]:
mi = ['Latvia','Paris','Augsburg','Milan']
mc = ['La','Fr','Ge']

In [5]:
df = p.DataFrame(data=mydata,index=mi,columns=mc)
df

          La  Fr  Ge
Latvia    95  11  81
Paris     70  63  87
Augsburg  75   9  77
Milan     40   4  63

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Latvia to Milan
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   La      4 non-null      int64
 1   Fr      4 non-null      int64
 2   Ge      4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

In [7]:
pwd

'/Users/ka53/Desktop/ml-practice/pandas'

In [8]:
ls

03-Useful-Methods copy.ipynb* series.ipynb
dataframe.ipynb

In [9]:
df = p.read_csv('/Users/ka53/Desktop/ml/Notebooks ML Rus V10/DATA/tips.csv')

In [10]:
df

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [11]:
df.columns # checking columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size',
       'price_per_person', 'Payer Name', 'CC Number', 'Payment ID'],
      dtype='object')

In [12]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [13]:
df.head(10) # first 10 rows

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679
6,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,Sun5985
7,26.88,3.12,Male,No,Sun,Dinner,4,6.72,Robert Buck,3514785077705092,Sun8157
8,15.04,1.96,Male,No,Sun,Dinner,2,7.52,Joseph Mcdonald,3522866365840377,Sun6820
9,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,3532124519049786,Sun3775

In [14]:
df.tail(5) # last five in rows

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,17.82,1.75,Male,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
dtypes: float64(3), int64(2), object(6)
memory usage: 21.1+ KB

In [16]:
df.describe()

       total_bill         tip        size  price_per_person     CC Number
count  244.000000  244.000000  244.000000        244.000000  2.440000e+02
mean    19.785943    2.998279    2.569672          7.888197  2.563496e+15
std      8.902412    1.383638    0.951100          2.914234  2.369340e+15
min      3.070000    1.000000    1.000000          2.880000  6.040679e+10
25%     13.347500    2.000000    2.000000          5.800000  3.040731e+13
50%     17.795000    2.900000    2.000000          7.255000  3.525318e+15
75%     24.127500    3.562500    3.000000          9.390000  4.553675e+15
max     50.810000   10.000000    6.000000         20.270000  6.596454e+15

In [17]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
total_bill,244.0,1.978594e+01,8.902412e+00,3.070000e+00,1.334750e+01,1.779500e+01,2.412750e+01,5.081000e+01
tip,244.0,2.998279e+00,1.383638e+00,1.000000e+00,2.000000e+00,2.900000e+00,3.562500e+00,1.000000e+01
size,244.0,2.569672e+00,9.510998e-01,1.000000e+00,2.000000e+00,2.000000e+00,3.000000e+00,6.000000e+00
price_per_person,244.0,7.888197e+00,2.914234e+00,2.880000e+00,5.800000e+00,7.255000e+00,9.390000e+00,2.027000e+01
CC Number,244.0,2.563496e+15,2.369340e+15,6.040679e+10,3.040731e+13,3.525318e+15,4.553675e+15,6.596454e+15

In [18]:
df.head(6)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679

In [19]:
df['price_per_person'].head(6)

0     8.49
1     3.45
2     7.00
3    11.84
4     6.15
5     6.32
Name: price_per_person, dtype: float64

In [20]:
df[['sex','time']].head(3)

      sex    time
0  Female  Dinner
1    Male  Dinner
2    Male  Dinner

In [21]:
100 * df['tip'].head(3) / df['total_bill'].head(3) # calculating

0     5.944673
1    16.054159
2    16.658734
dtype: float64

In [22]:
df['tp'] = 100 * df['tip'] / df['total_bill'] # adding new column

In [23]:
df.head(10)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tp
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,5.944673
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,16.054159
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,16.658734
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,13.978041
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,14.680765
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679,18.623962
6,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,Sun5985,22.805017
7,26.88,3.12,Male,No,Sun,Dinner,4,6.72,Robert Buck,3514785077705092,Sun8157,11.607143
8,15.04,1.96,Male,No,Sun,Dinner,2,7.52,Joseph Mcdonald,3522866365840377,Sun6820,13.031915
9,14.78,3.23,Male,No,Sun,Dinner,2,7.39,Jerome Abbott,3532124519049786,Sun3775,21.853857

In [24]:
df['tp'] = n.round(df['tip']/ df['total_bill'],2)

In [25]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tp
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,0.06
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,0.16
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,0.17
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,0.14
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,0.15

In [26]:
df.shape

(244, 12)

In [27]:
df.drop('tp', axis=1)
df.drop('tip-percent',axis=1)

KeyError: "['tip-percent'] not found in axis"

In [ ]:
#

In [48]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tp,tip-percent
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,0.06,0.06
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,0.16,0.16
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,0.17,0.17
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,0.14,0.14
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,0.15,0.15

In [49]:
df = df.drop(columns=['tp'])

In [50]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tip-percent
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,0.06
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,0.16
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,0.17
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,0.14
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,0.15

In [51]:
df = df.drop(columns=['tip-percent'])

In [52]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [ ]:
# LINES

In [54]:
df.index

RangeIndex(start=0, stop=244, step=1)

In [59]:
df.set_index('sex') # transform to index variable = 'sex' , but it will not save

,total_bill,tip,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
sex,,,,,,,,,,
Female,16.99,1.01,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
Male,10.34,1.66,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
Male,21.01,3.50,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
Male,23.68,3.31,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
Female,24.59,3.61,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...
Male,29.03,5.92,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
Female,27.18,2.00,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
Male,22.67,2.00,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
Male,17.82,1.75,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
Female,18.78,3.00,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [60]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [61]:
df = df.set_index('sex') # know we saved it , we can save only ones , after it will be error

In [62]:
df.head()

,total_bill,tip,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
sex,,,,,,,,,,
Female,16.99,1.01,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
Male,10.34,1.66,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
Male,21.01,3.50,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
Male,23.68,3.31,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
Female,24.59,3.61,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [63]:
df.reset_index() # without parameters , but without saving

,sex,total_bill,tip,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,Female,16.99,1.01,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,Male,10.34,1.66,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,Male,21.01,3.50,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,Male,23.68,3.31,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,Female,24.59,3.61,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...,...
239,Male,29.03,5.92,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
240,Female,27.18,2.00,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,Male,22.67,2.00,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
242,Male,17.82,1.75,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
243,Female,18.78,3.00,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [64]:
df.head()

,total_bill,tip,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
sex,,,,,,,,,,
Female,16.99,1.01,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
Male,10.34,1.66,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
Male,21.01,3.50,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
Male,23.68,3.31,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
Female,24.59,3.61,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [65]:
df = df.reset_index() # now we saved it

In [66]:
df.head()

,sex,total_bill,tip,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,Female,16.99,1.01,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,Male,10.34,1.66,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,Male,21.01,3.50,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,Male,23.68,3.31,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,Female,24.59,3.61,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [67]:
df = df.set_index('sex') # we add again variables 'sex' to column

In [68]:
df.head()

,total_bill,tip,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
sex,,,,,,,,,,
Female,16.99,1.01,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
Male,10.34,1.66,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
Male,21.01,3.50,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
Male,23.68,3.31,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
Female,24.59,3.61,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [72]:
df.iloc[0] # how to get individual line

total_bill                       16.99
tip                               1.01
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Payment ID                     Sun2959
Name: Female, dtype: object

In [77]:
df.loc['Male'] # we can get only what in column , so only variable = 'sex'

,total_bill,tip,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
sex,,,,,,,,,,
Male,10.34,1.66,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
Male,21.01,3.50,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
Male,23.68,3.31,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
Male,25.29,4.71,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679
Male,8.77,2.00,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,Sun5985
...,...,...,...,...,...,...,...,...,...,...
Male,12.60,1.00,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032
Male,32.83,1.17,Yes,Sat,Dinner,2,16.42,Thomas Brown,4284722681265508,Sat2929
Male,29.03,5.92,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
Male,22.67,2.00,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
Male,17.82,1.75,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17

In [ ]:
# i need to remove 'sex' , and put 'tip'

In [78]:
df = df.reset_index('sex')

In [79]:
df.head()

,sex,total_bill,tip,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,Female,16.99,1.01,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,Male,10.34,1.66,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,Male,21.01,3.50,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,Male,23.68,3.31,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,Female,24.59,3.61,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [81]:
df = df.set_index('tip')

In [82]:
df.head()

,sex,total_bill,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
tip,,,,,,,,,,
1.01,Female,16.99,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1.66,Male,10.34,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
3.50,Male,21.01,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3.31,Male,23.68,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
3.61,Female,24.59,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [83]:
df.iloc[0]

sex                             Female
total_bill                       16.99
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Payment ID                     Sun2959
Name: 1.01, dtype: object

In [85]:
df.loc[1.01]

sex                             Female
total_bill                       16.99
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Payment ID                     Sun2959
Name: 1.01, dtype: object

In [86]:
df.loc[4.00]

,sex,total_bill,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
tip,,,,,,,,,,
4.0,Male,27.20,No,Thur,Lunch,4,6.80,John Davis,30344778738589,Thur4924
4.0,Male,18.28,No,Thur,Lunch,2,9.14,Donald Williams,5363745772301404,Thur3636
4.0,Male,27.28,Yes,Fri,Dinner,2,13.64,Eric Carter,4563054452787961,Fri3159
4.0,Female,14.31,Yes,Sat,Dinner,2,7.16,Amanda Anderson,375638820334211,Sat2614
4.0,Male,38.07,No,Sun,Dinner,3,12.69,Jeff Lopez,3572865915176463,Sun591
4.0,Female,25.71,No,Sun,Dinner,3,8.57,Katie Smith,5400160161311292,Sun6492
4.0,Male,16.82,Yes,Sun,Dinner,2,8.41,Brian Miles,3586342145399277,Sun7621
4.0,Female,9.60,Yes,Sun,Dinner,2,4.80,Melanie Gray,4211808859168,Sun4598
4.0,Male,23.10,Yes,Sun,Dinner,3,7.70,Richard Stevens,3560193117506187,Sun1821
4.0,Male,16.58,Yes,Thur,Lunch,2,8.29,Benjamin Weber,676210011505,Thur9318
4.0,Male,18.71,Yes,Thur,Lunch,3,6.24,Jason Conrad,4581233003487,Thur6048
4.0,Male,20.53,Yes,Thur,Lunch,4,5.13,Scott Kim,3570611756827620,Thur2160

In [88]:
df.loc[[1,5]] # looking for 2 tips 'one' and 'five'

,sex,total_bill,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
tip,,,,,,,,,,
1.0,Female,3.07,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455
1.0,Female,5.75,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392,Fri3780
1.0,Female,7.25,No,Sat,Dinner,1,7.25,Terri Jones,3559221007826887,Sat4801
1.0,Male,12.60,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032
5.0,Female,35.26,No,Sun,Dinner,4,8.82,Diane Macias,4577817359320969,Sun6686
5.0,Male,31.27,No,Sat,Dinner,3,10.42,Mr. Brandon Berry,6011525851069856,Sat6373
5.0,Male,22.23,No,Sun,Dinner,2,11.12,Joshua Gilmore,4292072734899,Sun7097
5.0,Female,25.28,Yes,Sat,Dinner,2,12.64,Julie Holmes,5418689346409571,Sat6065
5.0,Male,32.68,Yes,Thur,Lunch,2,16.34,Daniel Murphy,5356177501009133,Thur8801
5.0,Male,41.19,No,Thur,Lunch,5,8.24,Eric Andrews,4356531761046453,Thur3621
5.0,Female,27.05,No,Thur,Lunch,6,4.51,Regina Jones,4311048695487,Thur6179
5.0,Male,48.17,No,Sun,Dinner,6,8.03,Ryan Gonzales,3523151482063321,Sun7518
5.0,Male,20.69,No,Sun,Dinner,5,4.14,Joseph Howell,30362407455623,Sun5842
5.0,Female,43.11,Yes,Thur,Lunch,4,10.78,Brooke Soto,5544902205760175,Thur9313

In [89]:
df.loc[1.01]

sex                             Female
total_bill                       16.99
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Payment ID                     Sun2959
Name: 1.01, dtype: object

In [91]:
df.drop(1.01) # deleting from variable = 'tip' 1.01 , but we did not save it

,sex,total_bill,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
tip,,,,,,,,,,
1.66,Male,10.34,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
3.50,Male,21.01,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3.31,Male,23.68,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
3.61,Female,24.59,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
4.71,Male,25.29,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679
...,...,...,...,...,...,...,...,...,...,...
5.92,Male,29.03,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657
2.00,Female,27.18,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
2.00,Male,22.67,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
1.75,Male,17.82,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
3.00,Female,18.78,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [92]:
df.head()

,sex,total_bill,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
tip,,,,,,,,,,
1.01,Female,16.99,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1.66,Male,10.34,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
3.50,Male,21.01,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3.31,Male,23.68,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
3.61,Female,24.59,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [93]:
one_row = df.iloc[0]

In [94]:
one_row

sex                             Female
total_bill                       16.99
smoker                              No
day                                Sun
time                            Dinner
size                                 2
price_per_person                  8.49
Payer Name          Christy Cunningham
CC Number             3560325168603410
Payment ID                     Sun2959
Name: 1.01, dtype: object

In [95]:
df.head()

,sex,total_bill,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
tip,,,,,,,,,,
1.01,Female,16.99,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1.66,Male,10.34,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
3.50,Male,21.01,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3.31,Male,23.68,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
3.61,Female,24.59,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [98]:
p.concat([df,p.DataFrame([one_row])]) # adding new row

,sex,total_bill,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
1.01,Female,16.99,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1.66,Male,10.34,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
3.50,Male,21.01,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3.31,Male,23.68,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
3.61,Female,24.59,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
...,...,...,...,...,...,...,...,...,...,...
2.00,Female,27.18,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
2.00,Male,22.67,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
1.75,Male,17.82,No,Sat,Dinner,2,8.91,Dennis Dixon,4375220550950,Sat17
3.00,Female,18.78,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672
1.01,Female,16.99,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959

In [29]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tp
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,0.06
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,0.16
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,0.17
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,0.14
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,0.15

In [34]:
df[df['tip'] > 5] # condition

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tp
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239,0.19
44,30.40,5.60,Male,No,Sun,Dinner,4,7.60,Todd Cooper,503846761263,Sun2274,0.18
47,32.40,6.00,Male,No,Sun,Dinner,4,8.10,James Barnes,3552002592874186,Sun9677,0.19
52,34.81,5.20,Female,No,Sun,Dinner,4,8.70,Emily Daniel,4291280793094374,Sun6165,0.15
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139,0.14
85,34.83,5.17,Female,No,Thur,Lunch,4,8.71,Shawna Cook,6011787464177340,Thur7972,0.15
88,24.71,5.85,Male,No,Thur,Lunch,2,12.36,Roger Taylor,4410248629955,Thur9003,0.24
116,29.93,5.07,Male,No,Sun,Dinner,4,7.48,Shawn Blake,4689079711213722,Sun22,0.17
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025,0.20
155,29.85,5.14,Female,No,Sun,Dinner,5,5.97,Madison Wilson,4210875236164664,Sun9176,0.17
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954,0.20
172,7.25,5.15,Male,Yes,Sun,Dinner,2,3.62,Larry White,30432617123103,Sun9209,0.71
181,23.33,5.65,Male,Yes,Sun,Dinner,2,11.66,Jason Cox,6556931703586223,Sun3402,0.24
183,23.17,6.50,Male,Yes,Sun,Dinner,4,5.79,Dr. Michael James,4718501859162,Sun6059,0.28
211,25.89,5.16,Male,Yes,Sat,Dinner,4,6.47,Christopher Li,6011962464150569,Sat6735,0.20
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590,0.19
214,28.17,6.50,Female,Yes,Sat,Dinner,3,9.39,Marissa Jackson,4922302538691962,Sat3374,0.23
239,29.03,5.92,Male,No,Sat,Dinner,3,9.68,Michael Avila,5296068606052842,Sat2657,0.20

In [42]:
a = df['total_bill'] > 30

In [43]:
df[a]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tp
11,35.26,5.00,Female,No,Sun,Dinner,4,8.82,Diane Macias,4577817359320969,Sun6686,0.14
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239,0.19
39,31.27,5.00,Male,No,Sat,Dinner,3,10.42,Mr. Brandon Berry,6011525851069856,Sat6373,0.16
44,30.40,5.60,Male,No,Sun,Dinner,4,7.60,Todd Cooper,503846761263,Sun2274,0.18
47,32.40,6.00,Male,No,Sun,Dinner,4,8.10,James Barnes,3552002592874186,Sun9677,0.19
52,34.81,5.20,Female,No,Sun,Dinner,4,8.70,Emily Daniel,4291280793094374,Sun6165,0.15
56,38.01,3.00,Male,Yes,Sat,Dinner,4,9.50,James Christensen DDS,349793629453226,Sat8903,0.08
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139,0.14
83,32.68,5.00,Male,Yes,Thur,Lunch,2,16.34,Daniel Murphy,5356177501009133,Thur8801,0.15
85,34.83,5.17,Female,No,Thur,Lunch,4,8.71,Shawna Cook,6011787464177340,Thur7972,0.15
95,40.17,4.73,Male,Yes,Fri,Dinner,4,10.04,Aaron Bentley,180026611638690,Fri9628,0.12
102,44.30,2.50,Female,Yes,Sat,Dinner,3,14.77,Heather Cohen,379771118886604,Sat6240,0.06
112,38.07,4.00,Male,No,Sun,Dinner,3,12.69,Jeff Lopez,3572865915176463,Sun591,0.11
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025,0.20
142,41.19,5.00,Male,No,Thur,Lunch,5,8.24,Eric Andrews,4356531761046453,Thur3621,0.12
156,48.17,5.00,Male,No,Sun,Dinner,6,8.03,Ryan Gonzales,3523151482063321,Sun7518,0.10
167,31.71,4.50,Male,No,Sun,Dinner,4,7.93,Michael Lawson,3566285921227119,Sun3719,0.14
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954,0.20
173,31.85,3.18,Male,Yes,Sun,Dinner,2,15.92,Scott Perez,3577115550328507,Sun9335,0.10
175,32.90,3.11,Male,Yes,Sun,Dinner,2,16.45,Nathan Reynolds,370307040837149,Sun5109,0.09
179,34.63,3.55,Male,Yes,Sun,Dinner,2,17.32,Brian Bailey,346656312114848,Sun9851,0.10
180,34.65,3.68,Male,Yes,Sun,Dinner,4,8.66,James Hebert DDS,676168737648,Sun7544,0.11
182,45.35,3.50,Male,Yes,Sun,Dinner,3,15.12,Jose Parsons,4112207559459910,Sun2337,0.08
184,40.55,3.00,Male,Yes,Sun,Dinner,2,20.27,Stephen Cox,3547798222044029,Sun5140,0.07
187,30.46,2.00,Male,Yes,Sun,Dinner,5,6.09,David Barrett,4792882899700988,Sun9987,0.07
197,43.11,5.00,Female,Yes,Thur,Lunch,4,10.78,Brooke Soto,5544902205760175,Thur9313,0.12
207,38.73,3.00,Male,Yes,Sat,Dinner,4,9.68,Ricky Ramirez,347817964484033,Sat4505,0.08
210,30.06,2.00,Male,Yes,Sat,Dinner,3,10.02,Shawn Mendoza,30184049218122,Sat8361,0.07
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590,0.19
219,30.14,3.09,Female,Yes,Sat,Dinner,4,7.54,Shelby House,502097403252,Sat8863,0.10
237,32.83,1.17,Male,Yes,Sat,Dinner,2,16.42,Thomas Brown,4284722681265508,Sat2929,0.04
238,35.83,4.67,Female,No,Sat,Dinner,3,11.94,Kimberly Crane,676184013727,Sat9777,0.13

In [54]:
df[(df['tip'] > 5) & (df['size'] > 3)] # more than 1

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tp
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239,0.19
44,30.40,5.60,Male,No,Sun,Dinner,4,7.60,Todd Cooper,503846761263,Sun2274,0.18
47,32.40,6.00,Male,No,Sun,Dinner,4,8.10,James Barnes,3552002592874186,Sun9677,0.19
52,34.81,5.20,Female,No,Sun,Dinner,4,8.70,Emily Daniel,4291280793094374,Sun6165,0.15
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139,0.14
85,34.83,5.17,Female,No,Thur,Lunch,4,8.71,Shawna Cook,6011787464177340,Thur7972,0.15
116,29.93,5.07,Male,No,Sun,Dinner,4,7.48,Shawn Blake,4689079711213722,Sun22,0.17
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025,0.20
155,29.85,5.14,Female,No,Sun,Dinner,5,5.97,Madison Wilson,4210875236164664,Sun9176,0.17
183,23.17,6.50,Male,Yes,Sun,Dinner,4,5.79,Dr. Michael James,4718501859162,Sun6059,0.28
211,25.89,5.16,Male,Yes,Sat,Dinner,4,6.47,Christopher Li,6011962464150569,Sat6735,0.20
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590,0.19

In [63]:
op = ['James Barnes']  #
df[df['Payer Name'].isin(op)]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tp
47,32.4,6.0,Male,No,Sun,Dinner,4,8.1,James Barnes,3552002592874186,Sun9677,0.19

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   total_bill        244 non-null    float64
 1   tip               244 non-null    float64
 2   sex               244 non-null    object
 3   smoker            244 non-null    object
 4   day               244 non-null    object
 5   time              244 non-null    object
 6   size              244 non-null    int64
 7   price_per_person  244 non-null    float64
 8   Payer Name        244 non-null    object
 9   CC Number         244 non-null    int64
 10  Payment ID        244 non-null    object
 11  tp                244 non-null    float64
dtypes: float64(4), int64(2), object(6)
memory usage: 23.0+ KB

In [34]:
def lf(num):
    return str(num)[-4:]

In [35]:
lf(343248848384738931234)

'1234'

In [36]:
df['CC Number'].apply(lf) # we checked cc number last four numbers

0      3410
1      9230
2      1322
3      5994
4      7221
       ...
239    2842
240    5404
241    7196
242    0950
243    8139
Name: CC Number, Length: 244, dtype: object

In [37]:
df['CC Number'].apply(lf).head(5)

0    3410
1    9230
2    1322
3    5994
4    7221
Name: CC Number, dtype: object

In [38]:
df['total_bill'].mean() # average bill

np.float64(19.78594262295082)

In [42]:
def yl(price):
    if price < 10:
        return '$'
    elif price >= 10 and price < 30:
        return '$$'
    else:
        return '$$$'
    
df['yl'] = df['total_bill'].apply(yl)

In [43]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tp,yl
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,0.06,$$
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,0.16,$$
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,0.17,$$
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,0.14,$$
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,0.15,$$

In [47]:
df[df['yl'] == '$$$']

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tp,yl
11,35.26,5.00,Female,No,Sun,Dinner,4,8.82,Diane Macias,4577817359320969,Sun6686,0.14,$$$
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239,0.19,$$$
39,31.27,5.00,Male,No,Sat,Dinner,3,10.42,Mr. Brandon Berry,6011525851069856,Sat6373,0.16,$$$
44,30.40,5.60,Male,No,Sun,Dinner,4,7.60,Todd Cooper,503846761263,Sun2274,0.18,$$$
47,32.40,6.00,Male,No,Sun,Dinner,4,8.10,James Barnes,3552002592874186,Sun9677,0.19,$$$
52,34.81,5.20,Female,No,Sun,Dinner,4,8.70,Emily Daniel,4291280793094374,Sun6165,0.15,$$$
56,38.01,3.00,Male,Yes,Sat,Dinner,4,9.50,James Christensen DDS,349793629453226,Sat8903,0.08,$$$
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139,0.14,$$$
83,32.68,5.00,Male,Yes,Thur,Lunch,2,16.34,Daniel Murphy,5356177501009133,Thur8801,0.15,$$$
85,34.83,5.17,Female,No,Thur,Lunch,4,8.71,Shawna Cook,6011787464177340,Thur7972,0.15,$$$
95,40.17,4.73,Male,Yes,Fri,Dinner,4,10.04,Aaron Bentley,180026611638690,Fri9628,0.12,$$$
102,44.30,2.50,Female,Yes,Sat,Dinner,3,14.77,Heather Cohen,379771118886604,Sat6240,0.06,$$$
112,38.07,4.00,Male,No,Sun,Dinner,3,12.69,Jeff Lopez,3572865915176463,Sun591,0.11,$$$
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025,0.20,$$$
142,41.19,5.00,Male,No,Thur,Lunch,5,8.24,Eric Andrews,4356531761046453,Thur3621,0.12,$$$
156,48.17,5.00,Male,No,Sun,Dinner,6,8.03,Ryan Gonzales,3523151482063321,Sun7518,0.10,$$$
167,31.71,4.50,Male,No,Sun,Dinner,4,7.93,Michael Lawson,3566285921227119,Sun3719,0.14,$$$
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954,0.20,$$$
173,31.85,3.18,Male,Yes,Sun,Dinner,2,15.92,Scott Perez,3577115550328507,Sun9335,0.10,$$$
175,32.90,3.11,Male,Yes,Sun,Dinner,2,16.45,Nathan Reynolds,370307040837149,Sun5109,0.09,$$$
179,34.63,3.55,Male,Yes,Sun,Dinner,2,17.32,Brian Bailey,346656312114848,Sun9851,0.10,$$$
180,34.65,3.68,Male,Yes,Sun,Dinner,4,8.66,James Hebert DDS,676168737648,Sun7544,0.11,$$$
182,45.35,3.50,Male,Yes,Sun,Dinner,3,15.12,Jose Parsons,4112207559459910,Sun2337,0.08,$$$
184,40.55,3.00,Male,Yes,Sun,Dinner,2,20.27,Stephen Cox,3547798222044029,Sun5140,0.07,$$$
187,30.46,2.00,Male,Yes,Sun,Dinner,5,6.09,David Barrett,4792882899700988,Sun9987,0.07,$$$
197,43.11,5.00,Female,Yes,Thur,Lunch,4,10.78,Brooke Soto,5544902205760175,Thur9313,0.12,$$$
207,38.73,3.00,Male,Yes,Sat,Dinner,4,9.68,Ricky Ramirez,347817964484033,Sat4505,0.08,$$$
210,30.06,2.00,Male,Yes,Sat,Dinner,3,10.02,Shawn Mendoza,30184049218122,Sat8361,0.07,$$$
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590,0.19,$$$
219,30.14,3.09,Female,Yes,Sat,Dinner,4,7.54,Shelby House,502097403252,Sat8863,0.10,$$$
237,32.83,1.17,Male,Yes,Sat,Dinner,2,16.42,Thomas Brown,4284722681265508,Sat2929,0.04,$$$
238,35.83,4.67,Female,No,Sat,Dinner,3,11.94,Kimberly Crane,676184013727,Sat9777,0.13,$$$

In [50]:
def simple(num):
    return num * 2

simple(8)

16

In [51]:
lambda num: num * 2

In [53]:
df['total_bill'].apply(lambda num: num * 2)

0      33.98
1      20.68
2      42.02
3      47.36
4      49.18
       ...
239    58.06
240    54.36
241    45.34
242    35.64
243    37.56
Name: total_bill, Length: 244, dtype: float64

In [72]:
def qualiti(total_bill,tip):
    if tip/total_bill > 0.25:
        return 'good tips'
    else:
        return 'normal tips'
    
qualiti(19,3)

'normal tips'

In [71]:
df['tip quality'] = df[['total_bill','tip']].apply(lambda df: qualiti(df['total_bill'],df['tip']),axis=1).head(10)

In [68]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tp,yl,tip quality
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959,0.06,$$,normal tips
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,0.16,$$,normal tips
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458,0.17,$$,normal tips
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260,0.14,$$,normal tips
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251,0.15,$$,normal tips

In [28]:
df.describe

<bound method NDFrame.describe of      total_bill   tip     sex smoker   day    time  size  price_per_person  \
0         16.99  1.01  Female     No   Sun  Dinner     2              8.49
1         10.34  1.66    Male     No   Sun  Dinner     3              3.45
2         21.01  3.50    Male     No   Sun  Dinner     3              7.00
3         23.68  3.31    Male     No   Sun  Dinner     2             11.84
4         24.59  3.61  Female     No   Sun  Dinner     4              6.15
..          ...   ...     ...    ...   ...     ...   ...               ...
239       29.03  5.92    Male     No   Sat  Dinner     3              9.68
240       27.18  2.00  Female    Yes   Sat  Dinner     2             13.59
241       22.67  2.00    Male    Yes   Sat  Dinner     2             11.34
242       17.82  1.75    Male     No   Sat  Dinner     2              8.91
243       18.78  3.00  Female     No  Thur  Dinner     2              9.39

             Payer Name         CC Number Payment ID    tp
0    Christy Cunningham  3560325168603410    Sun2959  0.06
1        Douglas Tucker  4478071379779230    Sun4608  0.16
2        Travis Walters  6011812112971322    Sun4458  0.17
3      Nathaniel Harris  4676137647685994    Sun5260  0.14
4          Tonya Carter  4832732618637221    Sun2251  0.15
..                  ...               ...        ...   ...
239       Michael Avila  5296068606052842    Sat2657  0.20
240      Monica Sanders  3506806155565404    Sat1766  0.07
241          Keith Wong  6011891618747196    Sat3880  0.09
242        Dennis Dixon     4375220550950      Sat17  0.10
243     Michelle Hardin  3511451626698139    Thur672  0.16

[244 rows x 12 columns]>

In [30]:
df.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
total_bill,244.0,1.978594e+01,8.902412e+00,3.070000e+00,1.334750e+01,1.779500e+01,2.412750e+01,5.081000e+01
tip,244.0,2.998279e+00,1.383638e+00,1.000000e+00,2.000000e+00,2.900000e+00,3.562500e+00,1.000000e+01
size,244.0,2.569672e+00,9.510998e-01,1.000000e+00,2.000000e+00,2.000000e+00,3.000000e+00,6.000000e+00
price_per_person,244.0,7.888197e+00,2.914234e+00,2.880000e+00,5.800000e+00,7.255000e+00,9.390000e+00,2.027000e+01
CC Number,244.0,2.563496e+15,2.369340e+15,6.040679e+10,3.040731e+13,3.525318e+15,4.553675e+15,6.596454e+15
tp,244.0,1.609426e-01,6.102968e-02,4.000000e-02,1.300000e-01,1.550000e-01,1.900000e-01,7.100000e-01

In [31]:
df.sort_values('price_per_person')

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tp
92,5.75,1.00,Female,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392,Fri3780,0.17
67,3.07,1.00,Female,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455,0.33
16,10.33,1.67,Female,No,Sun,Dinner,3,3.44,Elizabeth Foster,4240025044626033,Sun9715,0.16
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,0.16
172,7.25,5.15,Male,Yes,Sun,Dinner,2,3.62,Larry White,30432617123103,Sun9209,0.71
...,...,...,...,...,...,...,...,...,...,...,...,...
237,32.83,1.17,Male,Yes,Sat,Dinner,2,16.42,Thomas Brown,4284722681265508,Sat2929,0.04
175,32.90,3.11,Male,Yes,Sun,Dinner,2,16.45,Nathan Reynolds,370307040837149,Sun5109,0.09
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954,0.20
179,34.63,3.55,Male,Yes,Sun,Dinner,2,17.32,Brian Bailey,346656312114848,Sun9851,0.10
184,40.55,3.00,Male,Yes,Sun,Dinner,2,20.27,Stephen Cox,3547798222044029,Sun5140,0.07

In [32]:
df.sort_values('price_per_person', ascending=False)

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tp
184,40.55,3.00,Male,Yes,Sun,Dinner,2,20.27,Stephen Cox,3547798222044029,Sun5140,0.07
179,34.63,3.55,Male,Yes,Sun,Dinner,2,17.32,Brian Bailey,346656312114848,Sun9851,0.10
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954,0.20
175,32.90,3.11,Male,Yes,Sun,Dinner,2,16.45,Nathan Reynolds,370307040837149,Sun5109,0.09
237,32.83,1.17,Male,Yes,Sat,Dinner,2,16.42,Thomas Brown,4284722681265508,Sat2929,0.04
...,...,...,...,...,...,...,...,...,...,...,...,...
172,7.25,5.15,Male,Yes,Sun,Dinner,2,3.62,Larry White,30432617123103,Sun9209,0.71
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,0.16
16,10.33,1.67,Female,No,Sun,Dinner,3,3.44,Elizabeth Foster,4240025044626033,Sun9715,0.16
67,3.07,1.00,Female,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455,0.33
92,5.75,1.00,Female,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392,Fri3780,0.17

In [33]:
df.sort_values(['price_per_person','tip'])

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID,tp
92,5.75,1.00,Female,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392,Fri3780,0.17
67,3.07,1.00,Female,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455,0.33
16,10.33,1.67,Female,No,Sun,Dinner,3,3.44,Elizabeth Foster,4240025044626033,Sun9715,0.16
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608,0.16
172,7.25,5.15,Male,Yes,Sun,Dinner,2,3.62,Larry White,30432617123103,Sun9209,0.71
...,...,...,...,...,...,...,...,...,...,...,...,...
237,32.83,1.17,Male,Yes,Sat,Dinner,2,16.42,Thomas Brown,4284722681265508,Sat2929,0.04
175,32.90,3.11,Male,Yes,Sun,Dinner,2,16.45,Nathan Reynolds,370307040837149,Sun5109,0.09
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954,0.20
179,34.63,3.55,Male,Yes,Sun,Dinner,2,17.32,Brian Bailey,346656312114848,Sun9851,0.10
184,40.55,3.00,Male,Yes,Sun,Dinner,2,20.27,Stephen Cox,3547798222044029,Sun5140,0.07

In [34]:
df.corr(numeric_only=True)

,total_bill,tip,size,price_per_person,CC Number,tp
total_bill,1.000000,0.675734,0.598315,0.647554,0.104576,-0.334753
tip,0.675734,1.000000,0.489299,0.347405,0.110857,0.343895
size,0.598315,0.489299,1.000000,-0.175359,-0.030239,-0.141157
price_per_person,0.647554,0.347405,-0.175359,1.000000,0.135240,-0.313220
CC Number,0.104576,0.110857,-0.030239,0.135240,1.000000,-0.027643
tp,-0.334753,0.343895,-0.141157,-0.313220,-0.027643,1.000000

In [35]:
df['sex'].value_counts()

sex
Male      157
Female     87
Name: count, dtype: int64

In [44]:
df.head()

0    F
1    M
2    M
3    M
4    F
Name: sex, dtype: object

In [37]:
df['day'].unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [39]:
df['sex'].replace('Female','F')

0         F
1      Male
2      Male
3      Male
4         F
       ...
239    Male
240       F
241    Male
242    Male
243       F
Name: sex, Length: 244, dtype: object

In [47]:
df.head()

0    F
1    M
2    M
3    M
4    F
Name: sex, dtype: object

In [48]:
df = p.read_csv('/Users/ka53/Desktop/ml/Notebooks ML Rus V10/DATA/tips.csv')

In [49]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959
1,10.34,1.66,Male,No,Sun,Dinner,3,3.45,Douglas Tucker,4478071379779230,Sun4608
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251

In [50]:
r = p.DataFrame([1,2,3,3,3,3],['a','b','c','d','e','l'])

In [51]:
r.duplicated()

a    False
b    False
c    False
d     True
e     True
l     True
dtype: bool

In [52]:
r

   0
a  1
b  2
c  3
d  3
e  3
l  3

In [53]:
r.drop_duplicates()

   0
a  1
b  2
c  3

In [54]:
df['tip'].between(2,5)

0      False
1      False
2       True
3       True
4       True
       ...
239    False
240     True
241     True
242    False
243     True
Name: tip, Length: 244, dtype: bool

In [55]:
df[df['tip'].between(2,5)]

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
2,21.01,3.50,Male,No,Sun,Dinner,3,7.00,Travis Walters,6011812112971322,Sun4458
3,23.68,3.31,Male,No,Sun,Dinner,2,11.84,Nathaniel Harris,4676137647685994,Sun5260
4,24.59,3.61,Female,No,Sun,Dinner,4,6.15,Tonya Carter,4832732618637221,Sun2251
5,25.29,4.71,Male,No,Sun,Dinner,4,6.32,Erik Smith,213140353657882,Sun9679
6,8.77,2.00,Male,No,Sun,Dinner,2,4.38,Kristopher Johnson,2223727524230344,Sun5985
...,...,...,...,...,...,...,...,...,...,...,...
234,15.53,3.00,Male,Yes,Sat,Dinner,2,7.76,Tracy Douglas,4097938155941930,Sat7220
238,35.83,4.67,Female,No,Sat,Dinner,3,11.94,Kimberly Crane,676184013727,Sat9777
240,27.18,2.00,Female,Yes,Sat,Dinner,2,13.59,Monica Sanders,3506806155565404,Sat1766
241,22.67,2.00,Male,Yes,Sat,Dinner,2,11.34,Keith Wong,6011891618747196,Sat3880
243,18.78,3.00,Female,No,Thur,Dinner,2,9.39,Michelle Hardin,3511451626698139,Thur672

In [56]:
df.nlargest(5,'tip')

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
170,50.81,10.00,Male,Yes,Sat,Dinner,3,16.94,Gregory Clark,5473850968388236,Sat1954
212,48.33,9.00,Male,No,Sat,Dinner,4,12.08,Alex Williamson,676218815212,Sat4590
23,39.42,7.58,Male,No,Sat,Dinner,4,9.86,Lance Peterson,3542584061609808,Sat239
59,48.27,6.73,Male,No,Sat,Dinner,4,12.07,Brian Ortiz,6596453823950595,Sat8139
141,34.30,6.70,Male,No,Thur,Lunch,6,5.72,Steven Carlson,3526515703718508,Thur1025

In [57]:
df.nsmallest(5,'tip')

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
67,3.07,1.00,Female,Yes,Sat,Dinner,1,3.07,Tiffany Brock,4359488526995267,Sat3455
92,5.75,1.00,Female,Yes,Fri,Dinner,2,2.88,Leah Ramirez,3508911676966392,Fri3780
111,7.25,1.00,Female,No,Sat,Dinner,1,7.25,Terri Jones,3559221007826887,Sat4801
236,12.60,1.00,Male,Yes,Sat,Dinner,2,6.30,Matthew Myers,3543676378973965,Sat5032
0,16.99,1.01,Female,No,Sun,Dinner,2,8.49,Christy Cunningham,3560325168603410,Sun2959

In [59]:
df.sample(5) # always random 5 columns

,total_bill,tip,sex,smoker,day,time,size,price_per_person,Payer Name,CC Number,Payment ID
32,15.06,3.00,Female,No,Sat,Dinner,2,7.53,Amanda Wilson,213186304291560,Sat1327
215,12.90,1.10,Female,Yes,Sat,Dinner,2,6.45,Jessica Owen,4726904879471,Sat6983
213,13.27,2.50,Female,Yes,Sat,Dinner,2,6.64,Robin Andersen,580140531089,Sat1374
106,20.49,4.06,Male,Yes,Sat,Dinner,2,10.24,Karl Mcdaniel,180024452771522,Sat7865
143,27.05,5.00,Female,No,Thur,Lunch,6,4.51,Regina Jones,4311048695487,Thur6179